data/log/createProduct_request_xml.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.example.org/Ec/"><SOAP-ENV:Body><ns1:callService><paramsJson>{"product_sku":"EA140722165909","reference_no":"EA140722165909","product_title":"EA140722165909","product_weight":"0.35","product_length":"29.70","product_width":"21.00","product_height":"4","contain_battery":"0","product_declared_value":"10","product_declared_name":"EA140722165909","cat_lang":"en","cat_id_level0":"400001","cat_id_level1":"500013","cat_id_level2":"600109","verify":"1","images":["http:\/\/www.ruston-oms.com\/default\/system\/view-img?pa_id=3472","http:\/\/www.ruston-oms.com\/default\/system\/view-img?pa_id=3472","http:\/\/www.ruston-oms.com\/default\/system\/view-img?pa_id=3472","http:\/\/www.ruston-oms.com\/default\/system\/view-img?pa_id=3472"]}</paramsJson><appToken>df3c89455ff73a1d67d7ad5ad6598eb3</appToken><appKey>dea70dff3ce494c965346de0199086cc</appKey><service>createProduct</service></ns1:callService></SOAP-ENV:Body></SOAP-ENV:Envelope>
