data/log/createOrder_request_xml.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.example.org/Ec/"><SOAP-ENV:Body><ns1:callService><paramsJson>{"platform":"OTHER","warehouse_code":"HRBW","shipping_method":"F4","reference_no":"ref_1406018024","order_desc":"\u8ba2\u5355\u63cf\u8ff0","country_code":"RU","province":"province","city":"city","address1":"address1","address2":"address2","address3":"address3","zipcode":"142970","doorplate":"doorplate","name":"name","phone":"phone","email":"email","parcelDeclaredValue":"10.5","items":[{"product_sku":"DD","quantity":"1"}]}</paramsJson><appToken>df3c89455ff73a1d67d7ad5ad6598eb3</appToken><appKey>dea70dff3ce494c965346de0199086cc</appKey><service>createOrder</service></ns1:callService></SOAP-ENV:Body></SOAP-ENV:Envelope>
